# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [1]:
# import
import pandas as pd

In [2]:
# Load files
url1 = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"
url2 = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv"
url3 = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv"

df1 = pd.read_csv(url1) 
df2 = pd.read_csv(url2)
df3 = pd.read_csv(url3)

In [3]:
df1.shape, df2.shape, df3.shape

((4008, 11), (996, 11), (7070, 11))

In [4]:
display(df1, df2, df3)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.600000,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.200000,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.600000,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,1027.200000,Personal Auto,Luxury Car
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,451.200000,Corporate Auto,Two-Door Car
...,...,...,...,...,...,...,...,...,...,...,...
991,HV85198,Arizona,M,Master,847141.75%,63513,70,1/0/00,185.667213,Personal Auto,Four-Door Car
992,BS91566,Arizona,F,College,543121.91%,58161,68,1/0/00,140.747286,Corporate Auto,Four-Door Car
993,IL40123,Nevada,F,College,568964.41%,83640,70,1/0/00,471.050488,Corporate Auto,Two-Door Car
994,MY32149,California,F,Master,368672.38%,0,96,1/0/00,28.460568,Personal Auto,Two-Door Car
995,SA91515,California,M,Bachelor,399258.39%,0,111,1/0/00,700.349052,Personal Auto,SUV

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV
...,...,...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,23405.987980,Bachelor,M,71941,73,0,Personal Auto,198.234764,Four-Door Car
7066,PK87824,California,3096.511217,College,F,21604,79,0,Corporate Auto,379.200000,Four-Door Car
7067,TD14365,California,8163.890428,Bachelor,M,0,85,3,Corporate Auto,790.784983,Four-Door Car
7068,UP19263,California,7524.442436,College,M,21941,96,0,Personal Auto,691.200000,Four-Door Car
7069,Y167826,California,2611.836866,College,M,0,77,0,Corporate Auto,369.600000,Two-Door Car

## Cleaning Column Names

In [5]:
df1.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [6]:
df2.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')

In [7]:
df3.columns

Index(['Customer', 'State', 'Customer Lifetime Value', 'Education', 'Gender',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Total Claim Amount', 'Vehicle Class'],
      dtype='object')

In [8]:
# Column names To lower case and Replace White spaces
dataframes = [df1, df2, df3]

dataframes = [df.rename(columns={col: col.lower().strip().replace(" ", "_") for col in df.columns}, inplace=True) for df in dataframes]

In [9]:
# rename st to state
df1 = df1.rename(columns={'st': 'state'})
df2 = df2.rename(columns={'st': 'state'})

In [10]:
df1.columns, df2.columns, df3.columns

(Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
        'income', 'monthly_premium_auto', 'number_of_open_complaints',
        'policy_type', 'vehicle_class', 'total_claim_amount'],
       dtype='object'),
 Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
        'income', 'monthly_premium_auto', 'number_of_open_complaints',
        'total_claim_amount', 'policy_type', 'vehicle_class'],
       dtype='object'),
 Index(['customer', 'state', 'customer_lifetime_value', 'education', 'gender',
        'income', 'monthly_premium_auto', 'number_of_open_complaints',
        'policy_type', 'total_claim_amount', 'vehicle_class'],
       dtype='object'))

## Concatenate dataframes

In [11]:
df = pd.concat([df1, df2, df3], axis=0).reset_index(drop=True)

In [12]:
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [13]:
df.shape, df1.shape, df2.shape, df3.shape

((12074, 11), (4008, 11), (996, 11), (7070, 11))

In [14]:
df1.shape[0] + df2.shape[0] + df3.shape[0]

12074

## Cleaning Data

In [15]:
# Get Numeric and Categorical Data
numeric_columns = df.select_dtypes(include='number')
object_columns = df.select_dtypes(include='object')

In [16]:
# describe the unique values of each categorical column
for col in object_columns.columns:
    un_col_val = object_columns[col].unique()
    un_col_no = object_columns[col].nunique()
    print(f"\n The no of unique values for column '{col}' is {un_col_no}")
    print(f"The unique values for column '{col}' are {un_col_val}.")

 The no of unique values for column 'customer' is 9056
The unique values for column 'customer' are ['RB50392' 'QZ44356' 'AI49188' ... 'TD14365' 'UP19263' 'Y167826'].

 The no of unique values for column 'state' is 8
The unique values for column 'state' are ['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' 'Cali' 'AZ' 'WA'
 nan].

 The no of unique values for column 'gender' is 5
The unique values for column 'gender' are [nan 'F' 'M' 'Femal' 'Male' 'female'].

 The no of unique values for column 'education' is 6
The unique values for column 'education' are ['Master' 'Bachelor' 'High School or Below' 'College' 'Bachelors' 'Doctor'
 nan].

 The no of unique values for column 'customer_lifetime_value' is 8211
The unique values for column 'customer_lifetime_value' are [nan '697953.59%' '1288743.17%' ... 8163.890428 7524.442436 2611.836866].

 The no of unique values for column 'number_of_open_complaints' is 12
The unique values for column 'number_of_open_complaints' are ['1/0/00' '1/2/00' '1/1/00' '1/3/00' '1/5/00' '1/4/00' nan 0 2 3 1 5 4].

 The no of unique values for column 'policy_type' is 3
The unique values for column 'policy_type' are ['Personal Auto' 'Corporate Auto' 'Special Auto' nan].

 The no of unique values for column 'vehicle_class' is 6
The unique values for column 'vehicle_class' are ['Four-Door Car' 'Two-Door Car' 'SUV' 'Luxury SUV' 'Sports Car'
 'Luxury Car' nan].

In [17]:
# Standardize Gender Columns

def standardize_gender (label: str):
    """
    Standardize Gender Columns: if string start with F/M convert to"F"/"M" 
    """
    if isinstance(label, str):
        if label[0].upper() == "F":
            return "F"
        elif label[0].upper() == "M":
            return "M"
        else:
            return label

df['gender'] = df['gender'].apply(standardize_gender)
df['gender'].unique()

array([None, 'F', 'M'], dtype=object)

In [18]:
# In education, "Bachelors" could be replaced by "Bachelor"
df['education'] = df['education'].apply(lambda x: x[:-1] if x == "Bachelors" else x)
df['education'].unique()

array(['Master', 'Bachelor', 'High School or Below', 'College', 'Doctor',
       nan], dtype=object)

In [19]:
#In Customer Lifetime Value, delete the % character
df['customer_lifetime_value'] = round(df['customer_lifetime_value'].str.replace('%', '').astype(float) / 100, 2)
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,None,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,6979.54,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,12887.43,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,7645.86,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,5363.08,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [20]:
# In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"
## different approach: sports cars have usually 2 doors --> Two-Door-Car; Luxury indicates (both Luxury Car/SUV) --> SUV
def standardize_lux_cars (label: str):
    """
    Standardize Gender Columns: if string contains luxary convert to "SUV"
    """
    if isinstance(label, str):
        if "Lux" in label:
            return "SUV"
        elif "Sport" in label:
            return "Two-Door Car"
        else:
            return label

df['vehicle_class'] = df['vehicle_class'].apply(standardize_lux_cars)
df['vehicle_class'].unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', None], dtype=object)

In [21]:
# Number of open complaints has an incorrect format. Look at the different values it takes with unique() and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use split() to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.
df["number_of_open_complaints"] = df["number_of_open_complaints"].apply(lambda x: int(x.split("/")[1]) if isinstance(x,str) else x)
df["number_of_open_complaints"].unique()

array([ 0.,  2.,  1.,  3.,  5.,  4., nan])

## Dealing with Null values

In [22]:
df.notna().sum() # df.isna().sum()

customer                     9137
state                        9137
gender                       9015
education                    9137
customer_lifetime_value      2060
income                       9137
monthly_premium_auto         9137
number_of_open_complaints    9137
policy_type                  9137
vehicle_class                9137
total_claim_amount           9137
dtype: int64

In [23]:
df.shape

(12074, 11)

df[df.isna()]

In [26]:
#Strategy
##As there are many rows with 100% NaN values it looks like that these are just additional empty rows. And not rows where the data is just not available any more for any reason. I will thus drop all rows that contain only NaN values
df = df.dropna(how='all')

In [27]:
df.shape

(9137, 11)

In [28]:
df.notna().sum() # df.isna().sum()

customer                     9137
state                        9137
gender                       9015
education                    9137
customer_lifetime_value      2060
income                       9137
monthly_premium_auto         9137
number_of_open_complaints    9137
policy_type                  9137
vehicle_class                9137
total_claim_amount           9137
dtype: int64

In [30]:
# Fillna gender column - mode
df['gender'] = df['gender'].fillna(df['gender'].mode(dropna=True)[0])

# Fillna customer_lifetime_value column - median
df['customer_lifetime_value'] = df['customer_lifetime_value'].fillna(df['customer_lifetime_value'].median())

In [31]:
df.shape

(9137, 11)

## Integer cast

In [33]:
# get numeric columns
numeric_columns = df.select_dtypes(include='number')
numeric_columns.columns

Index(['customer_lifetime_value', 'income', 'monthly_premium_auto',
       'number_of_open_complaints', 'total_claim_amount'],
      dtype='object')

In [35]:
df[numeric_columns.columns] = df[numeric_columns.columns].astype(int)

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9137 entries, 0 to 12073
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9137 non-null   object
 1   state                      9137 non-null   object
 2   gender                     9137 non-null   object
 3   education                  9137 non-null   object
 4   customer_lifetime_value    9137 non-null   int32
 5   income                     9137 non-null   int32
 6   monthly_premium_auto       9137 non-null   int32
 7   number_of_open_complaints  9137 non-null   int32
 8   policy_type                9137 non-null   object
 9   vehicle_class              9137 non-null   object
 10  total_claim_amount         9137 non-null   int32
dtypes: int32(5), object(6)
memory usage: 678.1+ KB

## Exercise 5: Dealing with duplicates

In [38]:
def find_duplicates(df: pd.DataFrame):
    for colname in df.columns:
        print(f"The column {colname} has {df.duplicated(subset=[colname]).sum()} duplciates.")


find_duplicates(df)

The column customer has 81 duplciates.
The column state has 9129 duplciates.
The column gender has 9135 duplciates.
The column education has 9132 duplciates.
The column customer_lifetime_value has 7388 duplciates.
The column income has 3482 duplciates.
The column monthly_premium_auto has 8928 duplciates.
The column number_of_open_complaints has 9131 duplciates.
The column policy_type has 9134 duplciates.
The column vehicle_class has 9134 duplciates.
The column total_claim_amount has 7970 duplciates.

In [41]:
df['customer'].nunique()

9056

In [43]:
len(df)-df['customer'].nunique()

81

In [47]:
#  drop the duplicates in column customer -> from the previous lab customer seems to be a unique identifier -> thus the duplicates are considered real duplications
df.drop_duplicates(subset="customer", inplace=True)

In [48]:
def find_duplicates(df: pd.DataFrame):
    for colname in df.columns:
        print(f"The column {colname} has {df.duplicated(subset=[colname]).sum()} duplciates.")


find_duplicates(df)

The column customer has 0 duplciates.
The column state has 9048 duplciates.
The column gender has 9054 duplciates.
The column education has 9051 duplciates.
The column customer_lifetime_value has 7307 duplciates.
The column income has 3401 duplciates.
The column monthly_premium_auto has 8847 duplciates.
The column number_of_open_complaints has 9050 duplciates.
The column policy_type has 9053 duplciates.
The column vehicle_class has 9053 duplciates.
The column total_claim_amount has 7889 duplciates.

In [51]:
# check for duplicates without customer column
f[list(df.columns)[1:]].duplicated().sum()

279

In [53]:
# Getting the  duplicates
df.loc[df[list(df.columns)[1:]].duplicated(), :]

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
652,JH91579,Oregon,F,Bachelor,6846,0,95,0,Personal Auto,Two-Door Car,456
996,PV55726,Oregon,F,Master,4170,29462,107,1,Personal Auto,SUV,513
4226,TA89713,Oregon,M,College,5389,66429,136,0,Personal Auto,Two-Door Car,57
4241,UH62254,Oregon,M,Bachelor,21423,0,65,0,Personal Auto,Two-Door Car,312
4283,KN13494,Washington,F,Master,5181,97131,6464,0,Personal Auto,Four-Door Car,307
...,...,...,...,...,...,...,...,...,...,...,...
12028,SP29219,California,M,College,5720,0,105,0,Personal Auto,Four-Door Car,504
12035,IC80537,California,M,College,5720,46900,66,0,Corporate Auto,Four-Door Car,316
12041,CX22458,California,M,Master,5720,37722,116,0,Personal Auto,Two-Door Car,158
12062,FH43628,California,F,College,5720,13663,97,0,Personal Auto,Four-Door Car,465
12063,WZ45103,California,F,Bachelor,5720,0,76,0,Personal Auto,Four-Door Car,364

In [55]:
# drop other duplicates based an a set of columns
df.drop_duplicates(subset=list(df.columns)[1:], inplace=True)

In [56]:
df.shape

(8777, 11)

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [57]:
# Load files
url="https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv"

dfm = pd.read_csv(url)

In [58]:
dfm.head()

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,...,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,2
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,1
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,...,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,A,1

In [59]:
dfm.columns

Index(['unnamed:_0', 'customer', 'state', 'customer_lifetime_value',
       'response', 'coverage', 'education', 'effective_to_date',
       'employmentstatus', 'gender', 'income', 'location_code',
       'marital_status', 'monthly_premium_auto', 'months_since_last_claim',
       'months_since_policy_inception', 'number_of_open_complaints',
       'number_of_policies', 'policy_type', 'policy', 'renew_offer_type',
       'sales_channel', 'total_claim_amount', 'vehicle_class', 'vehicle_size',
       'vehicle_type', 'month'],
      dtype='object')

In [60]:
dfm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10910 entries, 0 to 10909
Data columns (total 27 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   unnamed:_0                     10910 non-null  int64
 1   customer                       10910 non-null  object
 2   state                          10910 non-null  object
 3   customer_lifetime_value        10910 non-null  float64
 4   response                       10910 non-null  object
 5   coverage                       10910 non-null  object
 6   education                      10910 non-null  object
 7   effective_to_date              10910 non-null  object
 8   employmentstatus               10910 non-null  object
 9   gender                         10910 non-null  object
 10  income                         10910 non-null  int64
 11  location_code                  10910 non-null  object
 12  marital_status                 10910 non-null  object
 13  monthly_premium_auto           10910 non-null  int64
 14  months_since_last_claim        10910 non-null  float64
 15  months_since_policy_inception  10910 non-null  int64
 16  number_of_open_complaints      10910 non-null  float64
 17  number_of_policies             10910 non-null  int64
 18  policy_type                    10910 non-null  object
 19  policy                         10910 non-null  object
 20  renew_offer_type               10910 non-null  object
 21  sales_channel                  10910 non-null  object
 22  total_claim_amount             10910 non-null  float64
 23  vehicle_class                  10910 non-null  object
 24  vehicle_size                   10910 non-null  object
 25  vehicle_type                   10910 non-null  object
 26  month                          10910 non-null  int64
dtypes: float64(4), int64(6), object(17)
memory usage: 2.2+ MB

In [61]:
# Get Numeric and Categorical Data
numeric_columns = dfm.select_dtypes(include='number')
object_columns = dfm.select_dtypes(include='object')

In [62]:
# describe the unique values of each categorical column
for col in object_columns.columns:
    un_col_val = object_columns[col].unique()
    un_col_no = object_columns[col].nunique()
    print(f"\n The no of unique values for column '{col}' is {un_col_no}")
    print(f"The unique values for column '{col}' are {un_col_val}.")

 The no of unique values for column 'customer' is 9134
The unique values for column 'customer' are ['DK49336' 'KX64629' 'LZ68649' ... 'KX53892' 'TL39050' 'WA60547'].

 The no of unique values for column 'state' is 5
The unique values for column 'state' are ['Arizona' 'California' 'Washington' 'Oregon' 'Nevada'].

 The no of unique values for column 'response' is 2
The unique values for column 'response' are ['No' 'Yes'].

 The no of unique values for column 'coverage' is 3
The unique values for column 'coverage' are ['Basic' 'Extended' 'Premium'].

 The no of unique values for column 'education' is 5
The unique values for column 'education' are ['College' 'Bachelor' 'High School or Below' 'Doctor' 'Master'].

 The no of unique values for column 'effective_to_date' is 59
The unique values for column 'effective_to_date' are ['2011-02-18' '2011-01-18' '2011-02-10' '2011-01-11' '2011-01-17'
 '2011-02-14' '2011-02-24' '2011-01-19' '2011-01-04' '2011-01-02'
 '2011-02-07' '2011-01-31' '2011-01-26' '2011-02-28' '2011-01-16'
 '2011-02-26' '2011-02-23' '2011-01-15' '2011-02-02' '2011-02-15'
 '2011-01-24' '2011-02-21' '2011-02-22' '2011-01-07' '2011-01-28'
 '2011-02-08' '2011-02-12' '2011-02-20' '2011-01-05' '2011-02-19'
 '2011-01-03' '2011-02-03' '2011-01-22' '2011-01-23' '2011-02-05'
 '2011-02-13' '2011-01-25' '2011-02-16' '2011-02-01' '2011-01-27'
 '2011-01-12' '2011-01-20' '2011-02-06' '2011-02-11' '2011-01-21'
 '2011-01-29' '2011-01-09' '2011-02-09' '2011-02-27' '2011-01-01'
 '2011-02-17' '2011-02-25' '2011-01-13' '2011-01-06' '2011-02-04'
 '2011-01-14' '2011-01-10' '2011-01-08' '2011-01-30'].

 The no of unique values for column 'employmentstatus' is 5
The unique values for column 'employmentstatus' are ['Employed' 'Unemployed' 'Medical Leave' 'Disabled' 'Retired'].

 The no of unique values for column 'gender' is 2
The unique values for column 'gender' are ['M' 'F'].

 The no of unique values for column 'location_code' is 3
The unique values for column 'location_code' are ['Suburban' 'Urban' 'Rural'].

 The no of unique values for column 'marital_status' is 3
The unique values for column 'marital_status' are ['Married' 'Single' 'Divorced'].

 The no of unique values for column 'policy_type' is 3
The unique values for column 'policy_type' are ['Corporate Auto' 'Personal Auto' 'Special Auto'].

 The no of unique values for column 'policy' is 9
The unique values for column 'policy' are ['Corporate L3' 'Personal L3' 'Personal L2' 'Corporate L2' 'Personal L1'
 'Special L1' 'Corporate L1' 'Special L3' 'Special L2'].

 The no of unique values for column 'renew_offer_type' is 4
The unique values for column 'renew_offer_type' are ['Offer3' 'Offer4' 'Offer2' 'Offer1'].

 The no of unique values for column 'sales_channel' is 4
The unique values for column 'sales_channel' are ['Agent' 'Call Center' 'Branch' 'Web'].

 The no of unique values for column 'vehicle_class' is 6
The unique values for column 'vehicle_class' are ['Four-Door Car' 'SUV' 'Two-Door Car' 'Sports Car' 'Luxury Car'
 'Luxury SUV'].

 The no of unique values for column 'vehicle_size' is 3
The unique values for column 'vehicle_size' are ['Medsize' 'Small' 'Large'].

 The no of unique values for column 'vehicle_type' is 1
The unique values for column 'vehicle_type' are ['A'].

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [72]:
# Create pivot table 
df_pivot_table = pd.pivot_table(dfm, index='sales_channel', values='customer_lifetime_value', aggfunc="sum").round(2)
df_pivot_table.head()

               customer_lifetime_value
sales_channel
Agent                      33057887.85
Branch                     24359201.21
Call Center                17364288.37
Web                        12697632.90

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [ ]:
# Your code goes here